{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "EsmModel",
    "parent_library": "transformers.models.esm.modeling_esm"
  },
  "base_model_name_or_path": "/Users/douzhixin/Developer/qPacking-esm/data/checkpoints/esm2_t30_150M_UR50D",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "encoder.layer.29.output.dense",
    "encoder.layer.29.attention.self.query",
    "encoder.layer.28.output.dense",
    "encoder.layer.29.attention.self.value",
    "encoder.layer.28.attention.output.dense",
    "encoder.layer.29.attention.output.dense",
    "encoder.layer.28.attention.self.value",
    "encoder.layer.28.attention.self.key",
    "encoder.layer.28.attention.self.query",
    "encoder.layer.29.attention.self.key"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}
